const myArr = [
  {
    lesson: 1,
    vocabulary: [
      'わたし',
      'わたしの',
      'わたしたち',
      'わたしたちの',
      'あなた',
      'あなたの',
      'あなたたち',
      'あなたたちの',
      'あのひと (あのかた)',
      'みなさん (みなさま)',
      'さん',
      'ちやん',
      'くん',
      'じん',
      'せんせい',
      'きようし',
      'がくせい',
      'かいしやいん',
      'しやいん',
      'ぎんこういん',
      'いしや',
      'けんきゆうしや',
      'だいがく',
      'びよういん',
      'でんき',
      'だれ (どなた)',
      'さい',
      'なんさい (おいくつ)',
      'はい',
      'いいえ',
      'しつれいですが',
      'はじめまして',
      'どうぞよろしくおねがいします',
      'こちらはみらさんです',
      'ばんぐらからきました',
      'かんこく',
      'ちゆうごく',
      'にほん',
      'エンジニア',
      'アメリカ',
      'イギリス',
      'インド',
      'インドネシア',
      'タイ',
      'ドイツ',
      'フランス',
      'ブラジル']
  },
  {
    lesson: 2,
    vocabulary: [
      'これ',
      'それ',
      'あれ',
      'この',
      'その',
      'あの',
      'ほん',
      'じしよ',
      'ざっし',
      'しんぶん',
      'てちよう',
      'めいし',
      'えんぴつ',
      'かぎ',
      'とけい',
      'かさ',
      'かばん',
      'じどうしや',
      'つくえ',
      'いす',
      'えいご',
      'にほんご',
      'ご',
      'なん',
      'そう',
      'ちがいます',
      'そうですか',
      'あのう',
      'ほんのきもちです',
      'どうぞ',
      'どうも',
      'どうもありがとございます',
      'これからおせわになります',
      'こちらこそよろしく',
      'ノート',
      'カード',
      'テレホンカード',
      'ボールペン',
      'シヤープペンシル',
      'カセットテープ',
      'テープレコーダ',
      'テレビ',
      'ラジオ',
      'カメラ',
      'コンピユーター',
      'チヨコレート',
      'コーヒー'
    ]
  },
  {
    lesson: 3,
    vocabulary: [
      'ここ', 'そこ', 'あそこ',
      'どこ', 'こちら', 'そちら',
      'あちら', 'どちら', 'きよしつ',
      'しよくどう', 'じむしよ', 'かいぎしつ',
      'うけつけ', 'へや', 'おてあらい',
      'かい（がい）', 'かいだん', 'おくに',
      'かいしや', 'うち', 'でんわ',
      'くつ', 'うりば', 'ちか',
      'たばこ', 'なんがい', 'えん',
      'いくら', 'ひやく', 'せん',
      'まん', 'すみません', 'でございます',
      'をみせてください', 'じや', 'をください',
      'しんおおさか',
      'ロビ', 'トイレ', 'エレベータ', 'エスカレータ', 'ネクタイ', 'ワイン', 'イタリア', 'スイス'
    ]
  },
  {
    lesson: 4,
    vocabulary: [
      'ぎんこう',
      'ゆうびんきよく',
      'としよかん',
      'びじゆつかん',
      'いま',
      'じ',
      'ふん（ぶん）',
      'はん',
      'なんじ',
      'なんぶん',
      'ごぜん',
      'ごご',
      'あさ',
      'ひる',
      'ばん（よる）',
      'おととい',
      'きのう',
      'きよう',
      'あした',
      'あさって',
      'けさ',
      'こんばん',
      'やすみ',
      'ひるやすみ',
      'まいあさ',
      'まいばん',
      'まいにち',
      'げつようび',
      'かいようび',
      'すいようび',
      'もくようび',
      'きにょうび',
      'どようび',
      'にちようび',
      'なんようび',
      'ばんごう',
      'から',
      'まで',
      'と',
      'そちら',
      'たいへんですね',
      'えーと',
      'おねがいします',
      'かしこまりました',
      'おといあわせのばんご',
      'どうもありがとございました',
      'デパート', 'ニユーヨーク', 'ペキン', 'ロンドン', 'バンコク', 'ロサンゼルス'
    ]
  },
  {
    lesson: 5,
    vocabulary: [
      'がっこう', 'えき', 'ひこうき',
      'ふね', 'でんしや', 'ちかてつ',
      'しんかんせん', 'じてんしや', 'あるいて',
      'ひと', 'ともだち', 'かれ',
      'かのじよ', 'かぞく', 'ひとりで',
      'せんしゆう', 'こんしゆう', 'らいしゆう',
      'せんげつ', 'こんげつ', 'らいげつ',
      'きよねん', 'ことし', 'らいねん',
      'がつ', 'なんがつ', 'ついたち',
      'ふつか', 'みっか', 'よっか',
      'いつか', 'むいか', 'なのか',
      'ようか', 'ここのか', 'とおか',
      'じゆうよっか', 'はつか', 'にじゆうよっか',
      'にち', 'なんにち', 'いつ',
      'たんじゆうび', 'ふつう', 'きゆうこう',
      'とっきゆう', 'つぎの', 'どういたしまして',
      'ばんせん', 'はかた', 'ふしみ',
      'こうしえん', 'おおさかじよう', 'スーパ', 'バス',
      'タクシ'
    ]
  },
  {
    lesson: 6,
    vocabulary: [
      'ごはん', 'あさごはん', 'ひるごはん',
      'ばんごはん', 'たまご', 'にく',
      'さかな', 'やさい', 'くだもの',
      'みず', 'おちや', 'こうちや',
      'ぎゆうにゆう', '［お］さけ', 'えいが',
      'てがみ', 'しやしん', 'みせ',
      'にわ', 'しゆくだい', '［お］はなみ',
      'なに', 'いっしよに', 'ちよっと',
      'いつも', 'それから', 'ええ',
      'いいですね', 'わかりました', 'なんですか',
      'じやまたあした', 'パン', 'ジユース',
      'ビール', 'ビデオ',
      'レポート', 'レストラン',
      'テニス', 'サッカー',
      'メキシコ'
    ]
  },
  {
    lesson: 7,
    vocabulary: [
      'て', 'はし',
      'はさみ', 'かみ',
      'はな', 'にもつ',
      'おかね', 'きっぷ',
      'ちち', 'はは',
      'おとうさん', 'おかあさん',
      'もう', 'まだ',
      'これから', 'すてきですね',
      'ごめんください', 'いらっしやい',
      'どうぞ', 'おあがりください',
      'しつれいします', '［は］いかがですか',
      'いただきます', 'りよこう',
      'おみやげ', 'けしゴム', 'スプーン', 'ナイフ',
      'フオーク', 'フアクス',
      'ワープロ', 'パソコン',
      'パンチ', 'ホツチキス',
      'セロテープ', 'シヤツ',
      'プレジント', 'クリスマス',
      'ヨーロッパ', 'スペイン'
    ]
  },
  {
    lesson: 8,
    vocabulary: [
      'きれい［な］',
      'しずか［な］',
      'にぎやか［な］',
      'ゆうめい［な］',
      'しんせつ［な］',
      'げんき［な］',
      'ひま［な］',
      'べんり［な］',
      'すてき［な］',
      'おおきい',
      'ちいさい',
      'あたらしい',
      'ふるい',
      'いい（よい）',
      'わるい',
      'あつい',
      'さむい',
      'つめたい',
      'むずかしい',
      'やさしい',
      'たかい',
      'やすい',
      'ひくい',
      'おもしろい',
      'おいしい',
      'いそがしい',
      'たのしい',
      'しろい',
      'くろい',
      'あかい',
      'あおい',
      'さくら',
      'やま',
      'まち',
      'たべもの',
      'くるま',
      'ところ',
      'りよう',
      'べんきよう',
      'せいかつ',
      'おしごと',
      'どう',
      'どんな',
      'どれ',
      'とても',
      'あまり',
      'そして',
      'が',
      'おげんきですか',
      'そうですね',
      'にほんのせいかつになれましたか',
      'もういっぱいいかがですか',
      'いいえ、けっこうです',
      'もうです［ね］',
      'そろそろしつれいします',
      'またいらっしやってください',
      'ふじさん',
      'びわこ',
      'しちにんのさむらい',
      'きんかくじ', 'ハンサム［な］', 'シヤンハイ'
    ]
  },
  {
    lesson: 9,
    vocabulary: [
      'すき［な］',
      'きらい［な］',
      'じようず［な］',
      'へた［な］',
      'りようり',
      'のみもの',
      '',
      'やきゆう',
      'おんがく',
      'うた',
      'かぶき',
      'え',
      'じ',
      'かんじ',
      'ひらがな',
      'かたかな',
      'こまかいおかね',
      'じかん',
      'ようじ',
      'やくそく',
      'たくさん',
      'ごしゆうじん',
      'おっと（しゆじん）',
      'おくさん',
      'つま（かない）',
      'こども',
      'よく',
      'だいたい',
      'すこし',
      'ぜんぜん',
      'はやく',
      'から',
      'どうして（なぜ）',
      'ざんねんですね',
      'すみません',
      'もしもし',
      'ああ',
      'いっしよにいかがですか',
      '［は］ちよっと',
      'だめですか',
      'またこんどおねがいします',
      'スポーツ', 'ダンス', 'クラシツク', 'ジヤズ', 'コンサート', 'カラオケ', 'ローマジ'
    ]
  },
  {
    lesson: 10,
    vocabulary: [
      'いろいろ［な］', 'おとこのひと',
      'おんなのひと', 'おとこのこ',
      'おんなのこ', 'いぬ',
      'ねこ', 'き',
      'もの', 'でんち',
      'はこ', 'れいぞうこ',
      'たな', 'まど',
      'こうえん', 'こっさてん',
      'ほんや', 'や',
      'のりば', 'けん',
      'うえ', 'した',
      'まえ', 'うしろ',
      'みぎ', 'ひだり',
      'なか', 'そと',
      'となり', 'ちかく',
      'あいだ', 'や［など］',
      'いちばん', 'だんめ',
      '［どうも］すみません', 'おく',
      'とうきよう デイズニーランド',
      'フイルム',
      'スイッチ',
      'テーベル',
      'ベッド',
      'ドア',
      'ポスト',
      'ビル',
      'チリソース',
      'スパイスコーナ'
    ]
  },
  {
    lesson: 11,
    vocabulary: [
      'ひとつ',
      'ふたつ',
      'みっつ',
      'よっつ',
      'いつつ',
      'むっつ',
      'ななつ',
      'やっつ',
      'ここのつ',
      'とお',
      'いくつ',
      'ひとり',
      'ふたり',
      'にん',
      'だい',
      'まい',
      'かい',
      'りんご',
      'みかん',
      'きって',
      'はがき',
      'ふうとう',
      'そくたつ',
      'かきとめ',
      'エアメール［こうくうびん］',
      'ふなびん',
      'りようしん',
      'きようだい',
      'しまい',
      'あに',
      'おにいさん',
      'あね',
      'おねえさん',
      'おとうと',
      'おとうとさん',
      'いもうと',
      'いもうとさん',
      'がいこく',
      'じかん',
      'しゆうかん',
      'かげつ',
      'ねん',
      'ぐらい',
      'どのくらい',
      'ぜんぶで',
      'みんな',
      'だけ',
      'いらっしやいませ',
      'いい［お］てんきですね',
      'おでかけですか',
      'ちよっとまで',
      'いっていらっしやい',
      'いってまいります',
      'それから',
      'サンドイッチ', 'カーレ［ライス］', 'アイスクリーム', 'オーストラリア'
    ]
  },
  {
    lesson: 12,
    vocabulary: [
      'かんたん［な］', 'ちかい', 'とおい',
      'はやい', 'おそい', 'おおい［ひとが］',
      'すくない［ひとが］', 'あたたかい', 'すずしい',
      'あまい', 'からい', 'おもい',
      'かるい', 'いい［コーヒ-が］', 'きせつ',
      'はる', 'なつ', 'あき',
      'ふゆ', 'でんき', 'あめ',
      'ゆき', 'くもり', 'くうこう',
      'うみ', 'せかい', '［お］まつり',
      'しけん', 'すきやき', 'ちしみ',
      '［お］すし', 'てんぷら', 'いけばな',
      'もみじ', 'とちら', 'とちらも',
      'ずっと', 'はじめて', 'ただいま',
      'おかえりなさい', 'すごいですね', 'でも',
      'つかれました', 'ぎおんまつり', 'ホテル',
      'パーテーイ', 'ホンコン', 'シンガポール'
    ]
  },
  {
    lesson: 13,
    vocabulary: [
      'たいへん［な］',
      'ほしい',
      'さびしい',
      'ひろい',
      'せまい',
      'しやくしよ',
      'かわ',
      'けいざい',
      'びじゆつ',
      'つり',
      'かいぎ',
      'とうろく',
      'しゆうまつ',
      'ごろ',
      'なにか',
      'どこか',
      'おなかがすきました',
      'おなかがいっぱいです',
      'のどがかわきました',
      'そうですね',
      'そうしましよう',
      'ごちゆうもんは',
      'ていしよく',
      'ぎゆうどん',
      '［しようしよう］おまちください',
      'べつべつに',
      'つるや',
      'おはようテレビ', "プール スキ", "ロシア"
    ]
  },
  {
    lesson: 14,
    vocabulary: [
      'なまえ',
      'じゆうしよ',
      'ちず',
      'しお',
      'さとう',
      'よみかた',
      'かた',
      'ゆっくり',
      'すぐ',
      'また',
      'あとで',
      'もうすこし',
      'もう',
      'いいですよ',
      'さあ',
      'あれ',
      'しんごうをみぎへまがってください',
      'まっすぐ',
      'これでおねがいします',
      'おつり',
      'うめだ', 'エアコン', 'パソポート'
    ]
  },
  {
    lesson: 15,
    vocabulary: [
      'しりよう', 'じこくひよう',
      'ふく', 'せいひん',
      'せんもん', 'はいしや',
      'とこや', 'どくしん',
      'とくに', 'おもいだします',
      'ごかぞく', 'いらっしやいます',
      'こうこう', 'にっぽんばし',
      'カタログ', 'ソフト', 'プレイガイド'
    ]
  }
]

const arrayForVerb = [
  {
    lesson: 4,
    vocabulary: ['おきます', 'ねます', 'はたらきます', 'やすみます', 'べんきようします', 'おわります']
  },
  {
    lesson: 5,
    vocabulary: ['いきます', 'きます', 'かえります']
  },
  {
    lesson: 6,
    vocabulary: ['たべます', 'のみます',
      'すいます', 'みます',
      'ききます', 'よみます',
      'かきます', 'かいます',
      'とります', 'します',
      'あいます']
  },
  {
    lesson: 7,
    vocabulary: ['きります', 'おきります',
      'あげます', 'もらいます',
      'かします', 'かります',
      'おしえます', 'ならいます',
      'かけます']
  },
  {
    lesson: 9,
    vocabulary: ["わかります", "います", "あります", "かかります", "やすみます"]
  },
  {
    lesson: 13,
    vocabulary: [
      'あそびます',
      'およぎます',
      'むかえます',
      'つかれます',
      'だします',
      'はいります',
      'でます',
      'けっこんします',
      'かいものします',
      'しよくじします',
      'さんぽします']
  },
  {
    lesson: 14,
    vocabulary: ['つけます', 'けします',
      'あけます', 'しめます',
      'いそぎます', 'まちます',
      'とめます', 'まがります',
      'もちます', 'とります',
      'てつだいます', 'よびます',
      'はなします', 'みせます',
      'おしえます', 'はじめます',
      'ふります']
  },
  {
    lesson: 15,
    vocabulary: ['たちます',
      'すわります',
      'つかいます',
      'おきます',
      'つくります',
      'うります',
      'しります',
      'すみます',
      'けんきゆうします',
      'しっています',
      'すんでいます']
  }
]


let myArrResult = myArr.map(item => item.vocabulary).flat();
let myVerbArrResult = arrayForVerb.map(item => item.vocabulary).flat();

let myArrResultCopy = [...myArrResult];
let myVerbArrResultCopy = [...myVerbArrResult];

const startbtn = document.getElementById("show");
const reStartbtn = document.getElementById("restart");

let selectedLesson = null;

// create a function for showing the data
function show() {
  const vocab = document.getElementById("vocab");
  const verb = document.getElementById("verb");


  const middleContent = document.getElementById("middle-content").style.display = "none";

  // Flatten the arrays

  const reArr = [];
  const verbArr = [];


  let vocabData = selectedLesson === null
    ? myArrResultCopy
    : myArr?.find(item => item.lesson === selectedLesson)?.vocabulary || [];

  // Randomly select unique vocabulary items (10 items)
  for (let i = 0; i < 10; i++) {

    if (vocabData.length === 0) break;  // Stop if no more items are left

    const randomIndex = Math.floor(Math.random() * vocabData.length);

    reArr.push(vocabData[randomIndex]);  // Add the selected item to reArr
    vocabData?.splice(randomIndex, 1);    // Remove the selected item from the copy
  }

  // Randomly select unique verb vocabulary items (10 items)
  for (let i = 0; i < 10; i++) {

    if (myVerbArrResultCopy.length === 0) break;  // Stop if no more items are left

    const randomIndex = Math.floor(Math.random() * myVerbArrResultCopy.length);

    verbArr.push(myVerbArrResultCopy[randomIndex]);  // Add the selected item to verbArr
    myVerbArrResultCopy.splice(randomIndex, 1);      // Remove the selected item from the copy
  }

  // Inject vocabulary list into HTML
  vocab.innerHTML = `
    <h2>Main Vocab ${selectedLesson !== null && `<span> Lesson: ${selectedLesson}</span>`}</h2>
    <ul class="ul">
        ${reArr.length !== 0 ? reArr?.map((item) => `<li class="list-items">${item}</li>`).join('') : "No items left"}
    </ul>
  `;

  // Inject verb vocabulary list into HTML
  verb.innerHTML = `
    <h2>Verb(ます) Vocab</h2>
    <ul>
        ${verbArr.length !== 0 ? verbArr?.map((item) => `<li class="list-items">${item}</li>`).join('') : "No items left"}
    </ul>
  `;

  if (vocabData.length === 0 && myVerbArrResultCopy.length === 0) {
    startbtn.style.display = "none";
    reStartbtn.style.display = "block";
  }
}

// Restart the showing data by clicking
function reStart() {
  selectedLesson = null;
  myArrResultCopy = [...myArrResult];
  myVerbArrResultCopy = [...myVerbArrResult];

  startbtn.style.display = "block";
  reStartbtn.style.display = "none";

  show();
}

function openPrompt() {
  const answer = window.prompt("Type lesson number that you want to see", 1);

  const lessonNumber = parseInt(answer);
  if (answer === null) {
    return;
  }

  if (isNaN(lessonNumber) || lessonNumber <= 0 || lessonNumber > 25) {
    alert("Please enter a valid number.");
    return;
  }


  selectedLesson = lessonNumber;
  show();
}





// console.log(reArr.map(item => item[1]));
